artifacts/bench/20260421T130610Z/limit_3000/stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/main.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * main: 3000.00 iterations/s for 30s (maxVUs: 50-1000, exec: run, gracefulStop: 30s)


running (0m01.0s), 0332/0333 VUs, 1809 complete and 0 interrupted iterations
main   [   3% ] 0332/0333 VUs  01.0s/30s  3000.00 iters/s

running (0m02.0s), 0682/0682 VUs, 3199 complete and 0 interrupted iterations
main   [   7% ] 0682/0682 VUs  02.0s/30s  3000.00 iters/s
time="2026-04-21T13:06:14Z" level=warning msg="Insufficient VUs, reached 1000 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=main

running (0m03.0s), 0999/1000 VUs, 4344 complete and 0 interrupted iterations
main   [  10% ] 0999/1000 VUs  03.0s/30s  3000.00 iters/s

running (0m04.0s), 0998/1000 VUs, 4769 complete and 0 interrupted iterations
main   [  13% ] 0998/1000 VUs  04.0s/30s  3000.00 iters/s

running (0m05.0s), 1000/1000 VUs, 5423 complete and 0 interrupted iterations
main   [  17% ] 1000/1000 VUs  05.0s/30s  3000.00 iters/s

running (0m06.0s), 1000/1000 VUs, 6508 complete and 0 interrupted iterations
main   [  20% ] 1000/1000 VUs  06.0s/30s  3000.00 iters/s

running (0m07.0s), 1000/1000 VUs, 6972 complete and 0 interrupted iterations
main   [  23% ] 1000/1000 VUs  07.0s/30s  3000.00 iters/s

running (0m08.0s), 1000/1000 VUs, 7452 complete and 0 interrupted iterations
main   [  27% ] 1000/1000 VUs  08.0s/30s  3000.00 iters/s

running (0m09.0s), 0999/1000 VUs, 8816 complete and 0 interrupted iterations
main   [  30% ] 0999/1000 VUs  09.0s/30s  3000.00 iters/s

running (0m10.0s), 1000/1000 VUs, 9219 complete and 0 interrupted iterations
main   [  33% ] 1000/1000 VUs  10.0s/30s  3000.00 iters/s

running (0m11.0s), 1000/1000 VUs, 9678 complete and 0 interrupted iterations
main   [  37% ] 1000/1000 VUs  11.0s/30s  3000.00 iters/s

running (0m12.0s), 1000/1000 VUs, 10129 complete and 0 interrupted iterations
main   [  40% ] 1000/1000 VUs  12.0s/30s  3000.00 iters/s

running (0m13.0s), 0999/1000 VUs, 10999 complete and 0 interrupted iterations
main   [  43% ] 0999/1000 VUs  13.0s/30s  3000.00 iters/s

running (0m14.0s), 1000/1000 VUs, 11763 complete and 0 interrupted iterations
main   [  47% ] 1000/1000 VUs  14.0s/30s  3000.00 iters/s

running (0m15.0s), 1000/1000 VUs, 12259 complete and 0 interrupted iterations
main   [  50% ] 1000/1000 VUs  15.0s/30s  3000.00 iters/s

running (0m16.0s), 1000/1000 VUs, 12725 complete and 0 interrupted iterations
main   [  53% ] 1000/1000 VUs  16.0s/30s  3000.00 iters/s

running (0m17.0s), 1000/1000 VUs, 13235 complete and 0 interrupted iterations
main   [  57% ] 1000/1000 VUs  17.0s/30s  3000.00 iters/s

running (0m18.0s), 1000/1000 VUs, 13690 complete and 0 interrupted iterations
main   [  60% ] 1000/1000 VUs  18.0s/30s  3000.00 iters/s

running (0m19.0s), 1000/1000 VUs, 14186 complete and 0 interrupted iterations
main   [  63% ] 1000/1000 VUs  19.0s/30s  3000.00 iters/s

running (0m20.0s), 1000/1000 VUs, 14588 complete and 0 interrupted iterations
main   [  67% ] 1000/1000 VUs  20.0s/30s  3000.00 iters/s

running (0m21.0s), 1000/1000 VUs, 15789 complete and 0 interrupted iterations
main   [  70% ] 1000/1000 VUs  21.0s/30s  3000.00 iters/s

running (0m22.0s), 1000/1000 VUs, 16196 complete and 0 interrupted iterations
main   [  73% ] 1000/1000 VUs  22.0s/30s  3000.00 iters/s

running (0m23.0s), 1000/1000 VUs, 16736 complete and 0 interrupted iterations
main   [  77% ] 1000/1000 VUs  23.0s/30s  3000.00 iters/s

running (0m24.0s), 1000/1000 VUs, 17212 complete and 0 interrupted iterations
main   [  80% ] 1000/1000 VUs  24.0s/30s  3000.00 iters/s

running (0m25.0s), 1000/1000 VUs, 17699 complete and 0 interrupted iterations
main   [  83% ] 1000/1000 VUs  25.0s/30s  3000.00 iters/s

running (0m26.0s), 1000/1000 VUs, 18189 complete and 0 interrupted iterations
main   [  87% ] 1000/1000 VUs  26.0s/30s  3000.00 iters/s

running (0m27.0s), 1000/1000 VUs, 18689 complete and 0 interrupted iterations
main   [  90% ] 1000/1000 VUs  27.0s/30s  3000.00 iters/s

running (0m28.0s), 1000/1000 VUs, 19187 complete and 0 interrupted iterations
main   [  93% ] 1000/1000 VUs  28.0s/30s  3000.00 iters/s

running (0m29.0s), 0999/1000 VUs, 20282 complete and 0 interrupted iterations
main   [  97% ] 0999/1000 VUs  29.0s/30s  3000.00 iters/s

running (0m30.0s), 1000/1000 VUs, 20950 complete and 0 interrupted iterations
main   [ 100% ] 1000/1000 VUs  30.0s/30s  3000.00 iters/s

running (0m31.0s), 0510/1000 VUs, 21440 complete and 0 interrupted iterations
main ↓ [ 100% ] 1000/1000 VUs  30s  3000.00 iters/s

running (0m32.0s), 0025/1000 VUs, 21925 complete and 0 interrupted iterations
main ↓ [ 100% ] 1000/1000 VUs  30s  3000.00 iters/s
time="2026-04-21T13:06:43Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/out/summary.json': open /out/summary.json: permission denied"

     ✓ get post 200
     ✓ like 200
     ✓ create post 201
     ✓ hot feed 200

     checks.........................: 100.00% ✓ 21950       ✗ 0     
     data_received..................: 136 MB  4.2 MB/s
     data_sent......................: 2.9 MB  92 kB/s
     dropped_iterations.............: 68056   2126.032176/s
     http_req_blocked...............: avg=33µs     min=635ns   med=3.4µs   max=8.29ms  p(90)=5.53µs   p(95)=57.26µs 
     http_req_connecting............: avg=21.58µs  min=0s      med=0s      max=8.25ms  p(90)=0s       p(95)=0s      
   ✗ http_req_duration..............: avg=1.34s    min=1.69ms  med=1.46s   max=2.75s   p(90)=2.25s    p(95)=2.35s   
       { expected_response:true }...: avg=1.34s    min=1.69ms  med=1.46s   max=2.75s   p(90)=2.25s    p(95)=2.35s   
   ✓ http_req_failed................: 0.00%   ✓ 0           ✗ 21950 
     http_req_receiving.............: avg=223.67µs min=12.84µs med=73.42µs max=20.79ms p(90)=487.61µs p(95)=847.39µs
     http_req_sending...............: avg=33.92µs  min=4.51µs  med=15.69µs max=6.54ms  p(90)=47.09µs  p(95)=99.78µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=1.34s    min=1.52ms  med=1.46s   max=2.75s   p(90)=2.25s    p(95)=2.35s   
     http_reqs......................: 21950   685.705981/s
     iteration_duration.............: avg=1.34s    min=2.2ms   med=1.46s   max=2.75s   p(90)=2.25s    p(95)=2.35s   
     iterations.....................: 21950   685.705981/s
     vus............................: 25      min=25        max=1000
     vus_max........................: 1000    min=333       max=1000


running (0m32.0s), 0000/1000 VUs, 21950 complete and 0 interrupted iterations
main ✓ [ 100% ] 0000/1000 VUs  30s  3000.00 iters/s
time="2026-04-21T13:06:43Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"